fraserb99/ee579-msp430/Group Project/main.c
            }
        } else if(button == -1){
            b_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button, 2);   //turn off timer
            P1IE &= ~BIT3;                          //and button interrupt
            P1REN |= BIT3;                          // and disable the pullup/pulldown
            button = 0; //set to default (off)
        }


        //check button 2, same code as button 1 pretty much, just different pins
        //Copied from button 1
        if (button2 > 0){
            if (!b2_activated){ //if not already activated
                P1OUT |= BIT5;                            //pull up resistor on P1.5
                P1REN |= BIT5;                            //Enable it
                P1IES |= BIT5;                            //high to low edge
                P1IFG &= ~BIT5;                           // Clear flag
                P1IE |= BIT5;                             //Interrupt enable

                int counts[1] = {debounce_b2};
                b2_activated = activate_free_timer(1, counts);
                //record which ones were activated
                activated_button2[0] = activated_timers[0];
                button2 = activated_button2[0];                //assign to check properly for timer interrupts
                if (b2_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send error
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic error
                    //disable button
                    button2 = -1;
                } else {
                    //turn of the timer for now
                    switch (button2){
                    case 1:
                        TA0CCR1 = 0;
                        break;
                    case 2:
                        TA0CCR2 = 0;
                        break;
                    case 3:
                        TA1CCR0 = 0;
                        break;
                    case 4:
                        TA1CCR1 = 0;
                        break;
                    case 5:
                        TA1CCR2 = 0;
                        break;
                    default:
                        //Something went wrong, send generic error message
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic error
                        button2 = -1; //disable button
                        break;
                    }
                }
            }

        } else if(button2 == -1){
            b2_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button2, 2);   //turn off timer
            P1IE &= ~BIT5;                          //and button interrupt
            P1REN |= BIT5;                          // and disable the pullup/pulldown
            button2 = 0;
        }

        //pot
        //can only run timer or pot
        //TODO: fix timer here
        if (pot > 0){
            if(t_activated) {
                //send error message as both can't be active
                send_message = 1;
                send[0][0] = 1; //set flag
                send[1][0] = 3; //clashing rules
                //disable pot
                pot = -1;
            } else {
                if(!pot_activated){         //if not already activated
                    ADC10CTL0 = ADC10ON + CONSEQ_0 + SREF_0;   // ADC10ON, single channel single sample, ref 0
                    ADC10CTL1 = INCH_4 + ADC10SSEL_1;          // input A4, clock = ACLK
                    ADC10AE0 |= BIT4;                          // PA.4 ADC option select

                    //get original value
                    ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                    orig_val = ADC10MEM;
                    pot_activated = 1;
                } else
                //TODO: remove comments if the code can work with temp
                //ADC10CTL0 |= SREF_0;                    //set ref to 0
                //ADC10CTL1 |= INCH_4;                     //Ensure right channel
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                //ADC10AE0 |= BIT4;                          // PA.4 ADC option select
                //ADC10MEM = conversion result
                //wait for result completion, triggers interrupt when done, ADC10Iflag
                /*while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                    //Wait for sample to take place
                }*/
                value = ADC10MEM;           //Just to make sure the value doesn't change during checking
                //reset ENC
                ADC10CTL0 &= ~ENC;

                if(value != orig_val){ //if value has changed
                    //check by how much
                    change = abs(orig_val - value);

                    if (change >= step_size){
                        //send message
                        send_message = 1;
                        send[0][3] = 1; //set flag
                        send[1][3] = value; //value of pot

                        //change to new orig value
                        orig_val = value;
                        //testing light
                        P1OUT ^= BIT6;
                    }

                }
            }

            //Code here for the potentiometer, so basically send stuff at interval checks
        } else if(pot == -1){
            pot_activated = 0;
        }

        //check if thermometer was requested
        if(thermometer > 0){
            //check for pot first
            if(pot_activated){
                //send error
                send_message = 1;
                send[0][0] = 1; //set flag
                send[1][0] = 3; //clashing rules
                //Disable temp
                thermometer = -1;
            } else{
                //based on example adc10_temp.c from URL: http://dev.ti.com/tirex/explore/node?node=AEldOKIXgnT979MckUlLRw__IOGqZri__LATEST
                if(!t_activated){
                    ADC10CTL0 = ADC10ON + SREF_1 + REFON; // ADC10ON, vr+ = Vref+f, Vr- = Vss, reference on, ref 1
                    ADC10CTL1 = INCH_10 + ADC10SSEL_1;    // temp sensor, clock = ACLK
                    ADC10AE0 |= BIT1;                     // PA.1 ADC option select

