fraserb99/ee579-msp430/Group Project/main.c
                    //set up a timer for stabilisation, use A1
                    //need a 30microsecond delay calculation time was 0.49, putting 10 to test, need only 1 timer
                    int counts[1] = {10};
                    t_activated = activate_free_timer(1, counts);
                    activated_temp[0] = activated_timers[0];      //record which ones were activated
                    thermometer = activated_temp[0];              //Set for proper check in interrupts
                    if (t_activated != 1) { //if return is 1, has now been activated
                        //something went wrong
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic
                        //disable temp
                        thermometer = -1;
                    }
                }

                if (sample_temp){
                    //TODO: remove comments to test with pot
                    //ADC10CTL0 = SREF_1
                    //ADC10CTL1 = INCH_10
                    //ADC10AE0 |= BIT1;
                    ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                    //based on code for pot above
                    //ADC10MEM = conversion result
                    while ((ADC10CTL1 & ADC10BUSY) == 1) {//check if busy
                        //Wait for sample to take place
                    }
                    temp = ADC10MEM;           //Just to make sure the value doesn't change during checking
                    //reset ENC
                    ADC10CTL0 &= ~ENC;
                    value_temp = ((temp - 673) * 423) / 1024;

                    if(value_temp != orig_temp){ //if value has changed
                        //check by how much
                        change_t = abs(orig_temp - value_temp);

                        if (change_t >= step_size_t){
                            //send message
                            send_message = 1;
                            send[0][4] = 1; //set flag
                            send[1][4] = value_temp; //temp value
                            //change to new orig value
                            orig_temp = value_temp;
                            //testing light
                            P1OUT ^= BIT0;
                        }
                    }

                    //set sample to false
                    sample_temp = 0;
                }
            }

        } else if(thermometer == -1){
            t_activated = 0;
            deactivate_timer(activated_temp, 1);
            thermometer = 0;
        }


        //Outputs
        //TODO: add checks for clashes
        //LED1
        //on/off
        if(led1_on == 1){
            if (!led1_active) {
              P1DIR |= BIT0;        // P1.0 output
            }

            //turn on LED D1
            P1OUT |= BIT0;
            //set the value to 0
            led1_on = 0;

        } else if(led1_on == -1) {
            P1OUT &= ~BIT0;         //turn light off
            led1_active = 0;        //not active anymore
            led1_on = 0;
        }

        //blinking
        if(led1_blink > 0){
            if(!led1_active){
                P1DIR |= BIT0;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led1_active = activate_free_timer(1, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated
                led1_blink = activated_led1[0];
                if (led1_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send generic error message
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the led
                    led1_blink = -1;
                }
                //toggle LED D1
                P1OUT ^= BIT0;
            }

        } else if (led1_blink == -1){
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 1);
            led1_blink = 0;
        }

        //fade in
        if(led1_fade_in > 0){
            if(!led1_active){
                P1DIR |= BIT0;
                P1OUT &= ~BIT0; //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_1};
                led1_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_in = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //send generic error message
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade in
                    led1_fade_in = -1;
                } else {
                    light_flag_1 = 0; //reset this
                    counter_val_1 = 0; //and this
                }

            }

        } else if (led1_fade_in == -1){
            //led1_active = 0; - light is still active
            deactivate_timer(activated_led1, 2);
            led1_fade_in = 0;
        }

        //fade out
        if(led1_fade_out > 0){
            if(!led1_fo_active){ //if light hasn't been activated, or if on
                P1DIR |= BIT0;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_1};
                led1_fo_active = activate_free_timer(2, counts);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_out = get_timer_code(activated_led1);
                if (led1_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade out
                    led1_fade_out = -1;
                } else {
                    led1_active = 1; //led is being used

                    //set the brightness to max
                    brightness_1 = max_brightness;
                    light_flag_1 = 1;
                    counter_val_1 = 0; //reset this
                    //need to turn on a light first, if not already on
                    P1OUT |= BIT0;
                }

