fraserb99/ee579-msp430/Group Project/main.c
            if(counter_val_3 >= max_brightness){                       //reached max value, reset
                counter_val_3 = 0;
            }
            TA0CCR2 += change_period;
        }

        //fade in part 2
        if((led3_fade_in == 11) || (led3_fade_in == 15)) {
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                P2OUT |= colours[colour];             //leave it on
                led3_fade_in = -1;          //completed task
            }

            TA0CCR2 += period_3;
        }

        //fade out part 2
        if((led3_fade_out == 11) || (led3_fade_out == 15)) {
            if(light_flag_3 == 1) {
                brightness_3 -= 1;                //decrease brightness
            }

             if(brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5);    //keep light off
                led3_fade_out = -1;          //completed task, deactivate it
            }

            TA0CCR2 += period_3;
        }

        //breathing part 2
        if((led3_breath == 11) || (led3_breath == 15)){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA0CCR2 += period_2;
        }

        //buzzer
        if(buzzer_tone == 2){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -1; //turn it off
            }

            TA0CCR2 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 2){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA0CCR2 += buzzer_period;
        }

        break;

    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for time A1
#pragma vector=TIMER1_A0_VECTOR
__interrupt void Timer1_A0 (void)
{
    //button stuff
    //check for how long button was pressed
    if ((button == 3) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timer_count += 1;
            //offset TA0CCR0 by the count number/period
            TA1CCR0 += count_b;
        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            send_message = 1;
            send[0][1] = 1; //set flag
            send[1][1] = timer_count; //the time held

            led1_blink = 1;
            //testing with light first
           // P1OUT ^= BIT0;
            held = 0;                               //button has now been released
            TA1CCR0 = 0;
        }

    } else if (button == 3){ //check that it is the button debouncing
        if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
             timer_count = 0;                     //Reset the timer count
             pressed = 0;                        //reset pressed
             held = 1;                           //Button is being held
             P1OUT ^= BIT6;
             //offset TA0CCR0 by the count number/period
             //change the value held in the array
             timers_used[0] = count_b;
             TA1CCR0 += count_b;

        } else {
            pressed = 0;                         //Button is not being pressed
        }

     }

    //button 2, copied code
    if ((button2 == 3) && (held2 == 1)) {
        if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
            timer_count2 += 1;
            //offset TA0CCR0 by the count number/period
            TA1CCR0 += count_b2;
        } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
            //send timer count signal here
            send_message = 1;
            send[0][1] = 1; //set flag
            send[1][1] = timer_count2; //the time held

            held2 = 0;                               //button has now been released
            TA1CCR0 = 0;
        }

    } else if (button2 == 3){ //check that it is the button debouncing
        if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
             timer_count2 = 0;                     //Reset the timer count
             pressed2 = 0;                        //reset pressed
             held2 = 1;                           //Button is being held
             //change the value held in the array
             timers_used[0] = count_b2;
             TA1CCR0 += count_b2;

        } else {
            pressed2 = 0;                         //Button is not being pressed
        }

