fraserb99/ee579-msp430/Group Project/main.c
     }


    //thermometer stuff
    if(thermometer == 3){
        if (!stable){
            stable = 1;
            //get original value, if possible here
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            temp = ADC10MEM;
            // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
            orig_temp = ((temp - 673) * 423) / 1024;

        } else {
            sample_temp = 1;        //start a sample
        }

        TA1CCR0 += sample_temp_time;
    }
    //outputs
    //LED1 blinking
    if(led1_blink == 3){
        P1OUT ^= BIT0;
        TA1CCR0 += blink_rate_1;
    }

    //fading in/out and breathing, part 1, can be 22 or 23
    if(((led1_fade_in == 22) || (led1_fade_in == 23)) || ((led1_fade_out == 22) || (led1_fade_out == 23)) || ((led1_breath == 22) || (led1_breath == 23))){
        if(counter_val_1 < brightness_1){
            P1OUT |= BIT0;                              //Turn on light
        } else {
            P1OUT &= ~BIT0;
        }
        counter_val_1 += 1;                             //Increment the value to read from the array

        if(counter_val_1 >= max_brightness){                       //reached max value, reset
            counter_val_1 = 0;
        }
        TA1CCR0 += change_period;
    }

    //fade in part 2
    if((led1_fade_in == 12) || (led1_fade_in == 16) || (led1_fade_in == 19)) {
        if(light_flag_1 == 0){
            brightness_1 += 1;                //increase brightness
        }

        if(brightness_1 == max_brightness){               //if max brightness
            P1OUT |= BIT0;             //leave it on
            led1_fade_in = -1;          //completed task
        }

        TA1CCR0 += period_1;
    }

    //fade out part 2
    if((led1_fade_out == 12) || (led1_fade_out == 16) || (led1_fade_out == 19)) {
        if(light_flag_1 == 1) {
            brightness_1 -= 1;                //decrease brightness
        }

         if (brightness_1 == 0) {       //reached lowest value
            P1OUT &= ~BIT0;                 //keep light off
            led1_fade_out = -1;          //completed task, deactivate it
        }

        TA1CCR0 += period_1;
    }

    //breathing part 2
    if((led1_breath == 12) || (led1_breath == 16) || (led1_breath == 19)){
        if(light_flag_1 == 0){
            brightness_1 += 1;                //increase brightness
        } else {
            brightness_1 -= 1;                //decrease brightness
        }

        if(brightness_1 == max_brightness){               //if max brightness
            light_flag_1 = 1;                //set to decrease
        } else if (brightness_1 == 0) {       //reached lowest value
            light_flag_1 = 0;                //increase light
        }

        TA1CCR0 += period_1;
    }

    //LED2 blinking
    if(led2_blink == 3){
        P1OUT ^= BIT6;
        TA1CCR0 += blink_rate_2;
    }

    //fading in/out and breathing, part 1, can be 22 or 23
    if(((led2_fade_in == 22) || (led2_fade_in == 23)) || ((led2_fade_out == 22) || (led2_fade_out == 23)) || ((led2_breath == 22) || (led2_breath == 23))){
        if(counter_val_2 < brightness_2){
            P1OUT |= BIT6;                              //Turn on light
        } else {
            P1OUT &= ~BIT6;
        }
        counter_val_2 += 1;                             //Increment the value to read from the array

        if(counter_val_2 >= max_brightness){                       //reached max value, reset
            counter_val_2 = 0;
        }
        TA1CCR0 += change_period;
    }

    //fade in part 2
    if((led2_fade_in == 12) || (led2_fade_in == 16) || (led2_fade_in == 19)) {
        if(light_flag_2 == 0){
            brightness_2 += 1;                //increase brightness
        }

        if(brightness_2 == max_brightness){               //if max brightness
            P1OUT |= BIT6;             //leave it on
            led2_fade_in = -1;          //completed task
        }

        TA1CCR0 += period_2;
    }

    //fade out part 2
    if((led2_fade_out == 12) || (led2_fade_out == 16) || (led2_fade_out == 19)) {
        if(light_flag_2 == 1) {
            brightness_2 -= 1;                //decrease brightness
        }

         if (brightness_2 == 0) {       //reached lowest value
            P1OUT &= ~BIT6;                 //keep light off
            led2_fade_out = -1;          //completed task, deactivate it
        }

        TA1CCR0 += period_2;
    }

    //breathing part 2
    if((led2_breath == 12) || (led2_breath == 16) || (led2_breath == 19)){
        if(light_flag_2 == 0){
            brightness_2 += 1;                //increase brightness
        } else {
            brightness_2 -= 1;                //decrease brightness
        }

        if(brightness_2 == max_brightness){               //if max brightness
            light_flag_2 = 1;                //set to decrease
        } else if (brightness_2 == 0) {       //reached lowest value
            light_flag_2 = 0;                //increase light
        }

        TA1CCR0 += period_2;
    }

    //LED3 rotating
    if(led3_rot == 3){
        //verify boundaries
        if ((colour == 0) && (led3_dir == -1)){
            colour = 6;
        } else if ((colour == 6) && (led3_dir == 1)){
            colour = 0;
        } else {
            colour = colour + led3_dir; //change colour based on direction
        }
        //swap colour
        P2OUT = colours[colour];
        TA1CCR0 += blink_rate_3;
    }
    //LED3 blink
    if(led3_blink == 3){
        if(led3_blink_on){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_blink_on = 0;
            TA1CCR0 += blink_rate_3;
        } else {
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            led3_blink_on = 1;
            //swap colour
            P2OUT = colours[colour];
            TA1CCR0 += blink_rate_3;
        }
    }

    //fading in/out and breathing, part 1, can be 22 or 23
    if(((led3_fade_in == 22) || (led3_fade_in == 23)) || ((led3_fade_out == 22) || (led3_fade_out == 23)) || ((led3_breath == 22) || (led3_breath == 23))){
        if(counter_val_3 < brightness_3){
            P2OUT |= colours[colour];                              //Turn on light
        } else {
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
        }
        counter_val_3 += 1;                             //Increment the value to read from the array

