fraserb99/ee579-msp430/Group Project/main.c
        //fade out part 2
        if((led3_fade_out == 14) || (led3_fade_out == 18) || (led3_fade_out == 21) || (led3_fade_out == 23) || (led3_fade_out == 24)) {
            if(light_flag_3 == 1) {
                brightness_3 -= 1;                //decrease brightness
            }

             if(brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //keep light off
                led3_fade_out = -1;          //completed task, deactivate it
            }

            TA1CCR2 += period_3;
        }

        //breathing part 2
        if((led3_breath == 14) || (led3_breath == 18) || (led3_breath == 21) || (led3_breath == 23) || (led3_breath == 24)){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA1CCR2 += period_3;
        }

        //buzzer
        if(buzzer_tone == 5){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -1; //turn it off
            }

            TA1CCR2 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 5){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA1CCR2 += buzzer_period;
        }
        break;


    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for the button, based on the slides/previous task
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void){
    //if it was the button that was pressed
    if(P1IFG & BIT3){
        pressed = 1;                            //Turn on flag for debouncer/check if button was pressed properly
        //debouncer timer, based on current count, check which one was used
        switch(button){
        case 0:
            TA0CCR0 = TAR + debounce_b;         //Current count plus the wanted debounce part
            break;
        case 1:
            TA0CCR1 = TAR + debounce_b;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b;
            break;
        }

        P1IFG &= ~BIT3;                             //clear flag
    } else if(P1IFG & BIT5){ //if it was button 2
        pressed2 = 1;
        //debouncer timer, based on current count, check which one was used
        switch(button2){
        case 0:
            TA0CCR0 = TAR + debounce_b2;         //Current count plus the wanted debounce part
            break;
        case 1:
            TA0CCR1 = TAR + debounce_b2;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b2;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b2;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b2;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b2;
            break;
        }
        P1IFG &= ~BIT5;                             //clear flag
    }


}


//Helper functions
//function for activating a specific timer
int activate_timer(int timer_no, int count1, int count2){
    if(timer_no == 0){
        TA0CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA0CCTL0 |= CCIE;                         // TA0CCR0 interrupt enabled
        if(count2 > 0){
            TA0CCTL1 |= CCIE;                         // TA0CCR1 interrupt enabled
            TA0CCR0 = count1;
            TA0CCR1 = count2;
            //set them to being used
            timers_used[0] = count1;
            timers_used[1] = count2;
        } else {
            TA0CCR0 = count1;

            timers_used[0] = count1;
        }
        timer0_activated = 1;
        return 1;
    } else if (timer_no == 1){
        TA1CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA1CCTL0 |= CCIE;
        if(count2 > 0){
            TA1CCTL1 |= CCIE;
            TA1CCR0 = count1;
            TA1CCR1 = count2;

            timers_used[3] = count1;
            timers_used[4] = count2;
        } else {
            TA1CCR0 = count1;
            timers_used[3] = count1;
        }

        timer1_activated = 1;
        return 1;
    }

